       IDENTIFICATION DIVISION.
       PROGRAM-ID. TIPOS-DE-DATOS.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
           01 NUMERO0 PIC 9 VALUE ZERO.
       PROCEDURE DIVISION.
       TIPOSDEDATOS.
            DISPLAY NUMERO0.
            STOP RUN.
       END PROGRAM TIPOS-DE-DATOS.
