       IDENTIFICATION DIVISION.
       PROGRAM-ID. Test1.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT OPTIONAL EMPLEADOS-ARCHIVO
           ASSIGN TO "c:\cobol\empleados.dat"
           ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
       STOP RUN.
       END PROGRAM Test1.
